app/controllers/admin/admin_controller.rb

	def reset
		render 'admin/reset.html'
		@judge = Judge.find(1)
---
SELECT "judges".* FROM "judges" WHERE "judges"."id" = ? LIMIT 1  [["id", 1]]