app/controllers/admin/judges_controller.rb

    def index
        @judges = Judge.find(:all)
---
SELECT "judges".* FROM "judges" WHERE "judges"."id" = ? LIMIT 1  [["id", 1]]

    def create
        num = params[:number].to_i
        i = 0
        while i < num
            code = SecureRandom.hex(2)
            if(Judge.where(access_code: code).size == 0)
                Judge.create!('access_code' => code)
---
SELECT COUNT(*) FROM "judges" WHERE "judges"."access_code" = 'ec65'
INSERT INTO "judges" ("access_code", "company_name", "name", "remember_token", "scores_count") VALUES (?, ?, ?, ?, ?)  [["access_code", "ec65"], ["company_name", nil], ["name", nil], ["remember_token", "xuXw0bqkT4tAd2wRM_ybRg"], ["scores_count", 0]]

    def clear
        Judge.where('id != 1').destroy_all
---
DELETE FROM "judges" WHERE "judges"."id" = ?  [["id", 1]]
SELECT "judges".* FROM "judges" WHERE "judges"."id" = ? LIMIT 1  [["id", 1]]