app/controllers/admin/judges_controller.rb

SELECT "judges".* FROM "judges"
---
    def index
        role = Judge.find_by_access_code(session[:password]).role
        if role == "superadmin"
            @judges = Judge.all

SELECT "judges".* FROM "judges"
---
    def clear
        Judge.where(role: "judge").destroy_all
        @judges = Judge.all