app/controllers/admin/posters_controller.rb

    def download
        File.delete("app/downloads/posters.csv") if File.exists?("app/downloads/posters.csv")
        @posters = Poster.all
---
SELECT "posters".* FROM "posters"