app/controllers/admin/posters_controller.rb

	def index
		@posters = Poster.all
---
SELECT "posters".* FROM "posters"

	def clear
		Poster.destroy_all
---
DELETE FROM "posters" WHERE "posters"."id" = ?  [["id", 1]]

	def rankings
        scores = Score.joins(:judge, :poster)
        @posters = Poster.find(:all)
        @avg_scores = Hash.new(0.0)

        for score in scores
            sum = (score.novelty + score.utility + score.difficulty + score.verbal + score.written)
            total = sum/5.0
            if(score.no_show || sum < 5.0)
                total = 0.0
            end

            @avg_scores[score.poster.number] = @avg_scores[score.poster.number] + total
        end

		if scores.empty? == false
---
SELECT "scores".* FROM "scores" INNER JOIN "judges" ON "judges"."id" = "scores"."judge_id" INNER JOIN "posters" ON "posters"."id" = "scores"."poster_id"
SELECT "posters".* FROM "posters" WHERE "posters"."id" = 1 LIMIT 1
SELECT "posters".* FROM "posters"