app/controllers/judges_controller.rb

    def set_disable()
        @disable = Array.new

        for score in @judge.scores
            first = Score.find(score.id).send(Score.score_terms[0])
---
SELECT "scores".* FROM "scores" WHERE "scores"."judge_id" = 32

    def assign(n = 1) # used for initial and additional assignments
        #create 2 - 3 new Scores for each poster assigned to this judge
        @judge ||= Judge.find(params[:judge_id])
        posters = Poster.find_least_judged().order(scores_count: :asc)
        posters = posters.reject {|p| @judge.posters.include?(p)}
---
SELECT "posters".* FROM "posters" WHERE "posters"."id" = 109 LIMIT 1