app/controllers/judges_controller.rb

    def show
        @judge = Judge.find(params[:id])
        @posters = @judge.posters.find(:all, :order => "number")
---
SELECT "posters".* FROM "posters" INNER JOIN "scores" ON "posters"."id" = "scores"."poster_id" WHERE "scores"."judge_id" = 1

    def assign
        @judge = Judge.find(params[:judge_id])
        error_msg = "Missing: "

	if(params[:name].empty?)
            error_msg += "name"
        end

        if(params[:company].empty?)
            if error_msg != "Missing: "
                error_msg += ", "
            end
            error_msg += "company"
        end
        if error_msg != "Missing: "
            flash[:error] = error_msg
            redirect_to judge_register_path and return
        end

        @judge.update_attributes(name: params[:name], company_name: params[:company])

        @posters = Poster.find_least_judged()
---
SELECT "posters".* FROM "posters" ORDER BY scores_count