app/controllers/posters_controller.rb

    def update
        #check to make sure all radio buttons are checked

        judge_id  = params[:judge_id]
        poster_id = params[:id]
        @score = Score.where(judge_id: judge_id, poster_id: poster_id).first()

        score = params[:score]
        score = score.map {|k,v| k, v = k.to_sym, v.to_i}.to_h

        begin
            @score.update_attributes!(score)
---
UPDATE "scores" SET "novelty" = 2, "utility" = 3, "difficulty" = 4, "verbal" = 3, "written" = 2, "no_show" = 'f' WHERE "scores"."id" = 3

    def no_show
        @score = Score.where(judge_id: params[:judge_id], poster_id: params[:poster_id]).first()
---
SELECT "scores".* FROM "scores" WHERE "scores"."judge_id" = 1 AND "scores"."poster_id" IS NULL LIMIT 1