app/controllers/posters_controller.rb

    def update
        #check to make sure all radio buttons are checked

        judge_id  = params[:judge_id]
        poster_id = params[:id]
        @score = Score.where(judge_id: judge_id, poster_id: poster_id).first()

        score = params[:score]
        score = score.map {|k,v| k, v = k.to_sym, v.to_i}.to_h

        begin
            @score.update_attributes!(score)
---
SELECT "scores".* FROM "scores" WHERE "scores"."judge_id" = 338 AND "scores"."poster_id" = 247 LIMIT 1
UPDATE "scores" SET "novelty" = 3, "utility" = 1, "difficulty" = 5, "verbal" = 5, "written" = 3 WHERE "scores"."id" = 270

    def no_show
        @score = Score.where(judge_id: params[:judge_id], poster_id: params[:poster_id]).first()

        @score.update_attributes(:no_show => true)
---
SELECT "scores".* FROM "scores" WHERE "scores"."judge_id" = 282 AND "scores"."poster_id" = 205 LIMIT 1
UPDATE "scores" SET "no_show" = 't' WHERE "scores"."id" = 201