app/controllers/posters_controller.rb

    def judge
        @poster = Poster.find(params[:poster_id])
        @judge = Judge.find(params[:judge_id])
---
SELECT "posters".* FROM "posters" WHERE "posters"."id" = $1 LIMIT 1  [["id", "115"]]
SELECT "judges".* FROM "judges" WHERE "judges"."id" = $1 LIMIT 1  [["id", "162"]]