app/controllers/sessions_controller.rb

  def create
    judge = Judge.find_by_access_code(params[:session][:password])
---
SELECT "judges".* FROM "judges" WHERE "judges"."access_code" = 'admin' LIMIT 1